app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hey this is Carson"], ["user_id", 101], ["created_at", "2017-10-30 18:39:37.943912"], ["updated_at", "2017-10-30 18:39:37.943912"]]