app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", "t"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "t"]]
---
  def index
    @users = User.where(activated: true).paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find params[:id]
    redirect_to root_url and return unless @user.activated?
    @microposts = @user.microposts.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "me"], ["email", "me@gmail.com"], ["password_digest", "$2a$10$WfW0Nw2/4/GJpOxGO.aqFecJ3TGi8hYRQZfKjWU9uDTzG3YTyctW6"], ["updated_at", "2017-10-21 19:21:42.512306"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)